{"---": 3, "layout: default": 1, "title: Paper formatting guidelines": 2, "The following instructions are for authors of papers submitted for review to ACL conferences (hereafter, \"review version\") or paper accepted for publication in its proceedings (hereafter, \"final version\").": 4, "All authors are required to adhere to these specifications.": 5, "Authors submitting papers for review must also follow: [Submitting your paper for review](review-version.html).": 6, "Authors of accepted papers must also follow: [Submitting the final version of your paper](final-version.html).": 7, "## Outline": 8, "{: .no_toc}": 9, "- TOC": 10, "{:toc}": 11, "## Style Files": 12, "*ACL provides style files for LaTeX and Microsoft Word that meet these requirements. They can be found here:": 13, "> https://github.com/acl-org/ACLPUB/tree/master/templates": 14, "We strongly recommend the use of these style files, which have been appropriately tailored for the *ACL proceedings.": 15, "## Paper Length": 16, "The conference accepts submissions of long papers and short papers.": 17, "Review versions of long papers may have up to eight (8) pages of content plus unlimited pages for references.": 18, "Upon acceptance, final versions of long papers will be given one additional page – up to nine (9) pages of content plus unlimited pages for acknowledgments and references – so that reviewers' comments can be taken into account.": 19, "Review versions of short papers may have up to four (4) pages of content, plus unlimited pages for references.": 20, "Final versions of short papers may have up to five (5) pages, plus unlimited pages for acknowledgments and references.": 21, "For both long and short papers, all figures and tables that are part of the main text must fit within these page limits.": 22, "The conference encourages submission of appendices and supplementary material, which are not required to fit within these page limits. However, review versions of papers must be self-contained: it is optional for reviewers to look at appendices or supplementary material. Please see [Appendices](#appendices) and [Supplementary Material](#supplementary-material) for more information.": 23, "Review versions should not refer, for further detail, to documents, code or data resources that are not available to the reviewers.": 24, "Papers that do not conform to these requirements may be rejected without review.": 25, "Workshop chairs may have different rules for allowed length and whether appendices or supplementary materials are welcome.": 26, "As always, the respective call for papers is the authoritative source.": 27, "## File Format": 28, "Papers must be in Adobe Portable Document Format (PDF).": 29, "Some word processors may generate very large PDF files, where each page is rendered as an image.": 30, "Such images may reproduce poorly.": 31, "In this case, try alternative ways to obtain the PDF.": 32, "Please make sure that your PDF file embeds all necessary fonts, especially for tree diagrams, symbols, and Asian languages.": 33, "If your paper uses Asian fonts, they must be embedded in the PDF file so that they can be displayed by non-Asian versions of the PDF reader (Asian versions ship with a larger set of default fonts).": 34, "START will not let you upload your final PDF without all fonts embedded.": 35, "When you print or create the PDF file, there is usually an option in your printer setup to include none, all or just non-standard fonts.": 36, "Please make sure that you select the option of including *all* the fonts.": 37, "If your paper includes PDF graphics, these files must also have embedded fonts.": 38, "You can check your final PDF with the command `pdffonts mypaper.pdf` and confirm that all the fonts say \"yes\" under \"emb\".": 39, "You can also test your PDF by viewing it and printing it on a different computer from the one where it was created.": 40, "All papers must use **A4 paper format** (21 cm x 29.7 cm).": 41, "Papers must not be submitted with any other paper size.": 42, "Here are a couple of ways to check this:": 43, "- Using pdfinfo: The `pdfinfo` command should include": 44, "Page size:      595.276 x 841.89 pts": 45, "in its output.": 46, "- Using Apple's Preview.app:": 47, "Open the PDF, and select Tools &rarr; Show Inspector or type ⌘I.": 48, "It should report a page size of 8.27 x 11.7 inches.": 49, "- Using Adobe Acrobat: Open the PDF, navigate to File &rarr; Properties... &rarr; Description.": 50, "The field labeled \"Page Size\" should read 8.27 × 11.69 in.": 51, "If you cannot meet the above requirements, please contact the publication chairs as soon as possible.": 52, "## Layout": 53, "All text except for page numbers must fit within the margins.": 54, "Review versions should have page numbers, centered in the bottom margin, but **pages should not be numbered in the final version.**": 55, "Manuscripts must be set in two columns.": 56, "Exceptions to the two-column format include the title, authors' names and complete addresses, which must be centered at the top of the first page, and any full-width figures or tables.": 57, "The exact dimensions for a page on A4 paper are:": 58, "* Left margin: 2.5 cm": 59, "* Right margin: 2.5 cm": 60, "* Top margin: 2.5 cm": 61, "* Bottom margin: 2.5 cm": 62, "* Column width: 7.7 cm": 63, "* Column height: 24.7 cm": 64, "* Gap between columns: 0.6 cm": 65, "In the review version, a ruler (line numbers in the left and right margins of the article) should be printed, so that reviewers may comment on particular lines in the paper.": 66, "The ruler should not change the appearance of any other content on the page.": 67, "The final version should not contain a ruler.": 68, "**Reviewers:**": 69, "If the ruler measurements do not align well with lines in the paper, you can also use fractional references (e.g., \"line 295.5\").": 70, "## Fonts": 71, "All text (except non-Latin scripts and mathematical formulas) should be set in **Times Roman**.": 72, "If Times Roman is unavailable, you may use **Times New Roman** or **Computer Modern Roman.**": 73, "The following table specifies what font sizes and styles must be used for each type of text in the manuscript.": 74, "| Type of Text          | Font Size | Style |": 75, "| --------------------- | --------- | ----- |": 76, "| paper title           | 15 pt     | bold  |": 77, "| author names          | 12 pt     | bold  |": 78, "| author affiliation    | 12 pt     |       |": 79, "| the word \"Abstract\"   | 12 pt     | bold  |": 80, "| section titles        | 12 pt     | bold  |": 81, "| subsection titles     | 11 pt     | bold  |": 82, "| document text         | 11 pt     |       |": 83, "| captions              | 10 pt     |       |": 84, "| abstract text         | 10 pt     |       |": 85, "| bibliography          | 10 pt     |       |": 86, "| footnotes             | 9 pt      |       |": 87, "## Title and Authors": 88, "Center the title and the author name(s) and affiliation(s) across both columns.": 89, "Place the title centered at the top of the first page, in 15-point bold.": 90, "Long titles should be typed on two lines without a blank line intervening.": 91, "Put the title 2.5 cm from the top of the page.": 92, "Write the title in [title case](https://apastyle.apa.org/style-grammar-guidelines/capitalization/title-case); do not write the title in all capital letters, except for acronyms and names (e.g., \"BLEU\") that are normally written in all capitals.": 93, "Place the author name(s) and affiliation(s) under the title.": 94, "Write authors' full names; do not abbreviate given names to initials, unless they are normally written as initials (\"Margaret Mitchell\", not \"M. Mitchell\").": 95, "Do not format surnames in all capitals (\"Mitchell\", not \"MITCHELL\").": 96, "Do not use footnotes for affiliations.": 97, "The affiliation should contain the author's complete address, and if possible, an electronic mail address.": 98, "The title, author names and addresses should be completely identical to those entered to the paper submission website in order to maintain the consistency of author information among all publications of the conference.": 99, "If they are different, the publication chairs may resolve the difference without consulting with you; so it is in your own interest to double-check that the information is consistent.": 100, "Start the body of the first page 7.5 cm from the top of the page.": 101, "**Even in the review version of the paper, you should maintain space for names and addresses so that they will fit in the final version.**": 102, "## Abstract": 103, "Type the abstract at the beginning of the first column.": 104, "Center the word **Abstract** in 12 point bold above the body of the abstract.": 105, "The width of the abstract should be smaller than the": 106, "normal column width by 0.6 cm on each side.": 107, "The abstract text should be 10 point roman, single-spaced.": 108, "The abstract should be a concise summary of the general thesis and conclusions of the paper.": 109, "It should be no longer than 200 words.": 110, "## Text": 111, "Begin typing the main body of the text immediately after the abstract, continuing in two columns.": 112, "The text should be 11 point roman, single-spaced.": 113, "Indent 0.4 cm when starting a new paragraph, except for the first paragraph in a section.": 114, "## Sections": 115, "Use numbered sections (Arabic numerals) to facilitate cross references.": 116, "Number subsections with the section number and the subsection number separated by a dot, in Arabic numerals, e.g.,": 117, "> 1 Introduction": 118, "or": 119, "> 6.1 File Format": 120, "## Footnotes": 121, "Put footnotes at the bottom of the page and use 9 point font.": 122, "They may be numbered or referred to by asterisks or other symbols.": 123, "Footnotes should be separated from the text by a line.": 124, "## Figures and tables": 125, "Place figures and tables in the paper near where they are first discussed, rather than at the end, if possible.": 126, "Wide figures/tables may run across both columns.": 127, "Graphics and photos should, if possible, use vector graphic formats (PDF,": 128, "EPS), which allow the graphics to scale arbitrarily. Avoid GIF or": 129, "JPEG images that are low resolution or highly compressed.": 130, "Your paper must look good both when printed (A4 size) and when viewed onscreen as PDF (zoomable to any": 131, "size). Please check that graphics and photos": 132, "are legible when printed and in a PDF viewer at different resolutions.": 133, "At the same time, keep file sizes manageable.": 134, "**Accessibility:**": 135, "Please prioritise the accessibility of your paper. The Diversity & Inclusion committee for ACL2020 has provided some [tips](https://acl2020.org/blog/accessibility-for-camera-ready/) on how to do this. To accommodate people who are color-blind (as well as those printing with black-and-white printers), grayscale readability is strongly encouraged.": 136, "Color is not forbidden, but authors should ensure that tables and figures do not rely solely on color to convey critical distinctions.": 137, "**Captions:**": 138, "Provide a caption for every figure/table; number each one sequentially in the form:": 139, "> Figure 1: Caption of the Figure.": 140, "and": 141, "> Table 1: Caption of the Table.": 142, "Captions should be placed below figures/tables, in 10 point roman type.": 143, "Captions that are one line are centered.": 144, "Captions longer than one line are left-aligned.": 145, "## Hyperlinks": 146, "Within-document and external hyperlinks should be dark blue (hex #000099), not underlined or boxed.": 147, "## Non-English Text": 148, "Text in languages other than English should be accompanied by translations into English, and text in scripts other than Latin should *also* be accompanied by transliterations into Latin script, since not all readers can recognize non-Latin characters easily.": 149, "For example, παράδειγμα *paradeigma* ‘example’ is a Greek word, and this is a Greek sentence:": 150, "> Αυτό είναι ένα παράδειγμα.": 151, "> auto einai ena paradeigma.": 152, "> ‘This is an example.’": 153, "## Citations": 154, "Citations within the text appear in parentheses (Gusfield, 1997), or, if the author's name appears in the text itself: Gusfield (1997).": 155, "Append lowercase letters to the year in cases of ambiguities.": 156, "Cite papers with two authors using both authors' names (Aho and Ullman, 1972), but cite papers with more than two authors by the first author's name and \"et al.\" (Chandra et al., 1981).": 157, "Collapse multiple citations into a single pair of parentheses (Gusfield, 1997; Aho and Ullman, 1972).": 158, "Refrain from using full citations as sentence constituents.": 159, "Instead of": 160, "> (Gusfield, 1997) showed that ...": 161, "> In (Gusfield, 1997), ...''": 162, "write": 163, "> Gusfield (1997) showed that ...": 164, "> In Gusfield (1997), ...": 165, "Submissions should accurately reference prior and related work, including code and data.": 166, "If a piece of prior work appeared in multiple venues, the version that appeared in a refereed, archival venue should be referenced.": 167, "If multiple versions of a piece of prior work exist, the one used by the authors should be referenced.": 168, "## Acknowledgments": 169, "The acknowledgments should go immediately before the references.": 170, "Do not number the acknowledgments section.": 171, "Do not include this section in the review version.": 172, "## References": 173, "Gather the full set of references together under the unnumbered section heading **References**.": 174, "Place the References section before any Appendices.": 175, "Arrange the references alphabetically by first author, rather than by order of occurrence in the text.": 176, "Provide as complete a citation as possible, using a consistent format, such as the [one for Computational Linguistics](http://cljournal.org/style_guide_refs.html) or the one in the [Publication Manual of the American Psychological Association](https://apastyle.apa.org/products/publication-manual-7th-edition).": 177, "Use full names for authors, not just initials.": 178, "Authors should not rely on automated citation indices to provide accurate references for prior and related work.": 179, "As part of our work to make ACL materials more widely used and cited outside of our discipline, ACL has registered as a CrossRef member, as a registrant of Digital Object Identifiers (DOIs), the standard for registering permanent URNs for referencing scholarly materials.": 180, "All references are required to contain DOIs of all cited works when possible, or, as a second resort, links to ACL Anthology pages.": 181, "Appropriate records should be found for most materials in the current [ACL Anthology](https://aclanthology.org/).": 182, "Example article in a journal:": 183, "> Rie Kubota Ando and Tong Zhang. 2005. [A framework for learning predictive structures from multiple tasks and unlabeled data](https://www.jmlr.org/papers/v6/ando05a.html). *Journal of Machine Learning Research*, 6:1817–1853.": 184, "Example paper in non-ACL proceedings, with DOI:": 185, "> Galen Andrew and Jianfeng Gao. 2007. [Scalable training of L1-regularized log-linear models](https://doi.org/10.1145/1273496.1273501). In *Proceedings of the 24th International Conference on Machine Learning*, pages 33–40.": 186, "Example ACL Anthology paper with DOI:": 187, "> James Goodman, Andreas Vlachos, and Jason Naradowsky. 2016. [Noise reduction and targeted exploration in imitation learning for Abstract Meaning Representation parsing](http://dx.doi.org/10.18653/v1/P16-1001). In *Proceedings of the 54th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)*, pages 1–45711, Berlin, Germany. Association for Computational Linguistics.": 188, "Example ACL Anthology paper without DOI:": 189, "> Benjamin Börschinger and Mark Johnson. 2011. [A particle filter algorithm for Bayesian word segmentation](https://aclanthology.org/U11-1004/). In *Proceedings of the Australasian Language Technology Association Workshop 2011*, pages 10–44718, Canberra, Australia.": 190, "Example arXiv paper:": 191, "> Mohammad Sadegh Rasooli and Joel R. Tetreault. 2015. [Yara parser: A fast and accurate dependency parser](http://arxiv.org/abs/1503.06733). *Computing Research Repository*, arXiv:1503.06733. Version 2.": 192, "## Appendices": 193, "Appendices are material that can be read, and include lemmas, formulas, proofs, and tables that are not critical to the reading and understanding of the paper.": 194, "Letter them in sequence and provide an informative title:": 195, "> Appendix A. Title of Appendix": 196, "The appendices come after the references.": 197, "Review versions of appendices must follow the same anonymity guidelines as the main paper.": 198, "## Supplementary Material": 199, "Submissions may include non-readable supplementary material used in the work and described in the paper.": 200, "Any accompanying software and/or data should include licenses and documentation of research review as appropriate.": 201, "Supplementary material may report preprocessing decisions, model parameters, and other details necessary for the replication of the experiments reported in the paper.": 202, "Seemingly small preprocessing decisions can sometimes make a large difference in performance, so it is crucial to record such decisions to precisely characterize state-of-the-art methods.": 203, "Nonetheless, supplementary material should be supplementary (rather than central) to the paper.": 204, "**Submissions that misuse the supplementary material may be rejected without review.**": 205, "Supplementary material may include explanations or details of proofs or derivations that do not fit into the paper, lists of features or feature templates, sample inputs and outputs for a system, pseudo-code or source code, and data.": 206, "(Source code and data should be separate uploads, rather than part of the paper).": 207, "The paper should not rely on the supplementary material: while the paper may refer to and cite the supplementary material and the supplementary material will be available to the reviewers, they will not be asked to review the supplementary material.": 208, "Review versions of supplementary material must follow the same anonymity guidelines as the main paper.": 209, "## Credits": 210, "This document has been adapted from the instructions for earlier ACL and NAACL proceedings, including those for": 211, "ACL 2020 by Steven Bethard, Ryan Cotterell and Rui Yan,": 212, "ACL 2019 by Douwe Kiela and Ivan Ivan Vulić,": 213, "NAACL 2019 by Stephanie Lukin and Alla Roskovskaya,": 214, "ACL 2018 by Shay Cohen, Kevin Gimpel, and Wei Lu,": 215, "NAACL 2018 by Margaret Mitchell and Stephanie Lukin,": 216, "BibTeX suggestions for (NA)ACL 2017/2018 from Jason Eisner,": 217, "ACL 2017 by Dan Gildea and Min-Yen Kan,": 218, "NAACL 2017 by Margaret Mitchell,": 219, "ACL 2012 by Maggie Li and Michael White,": 220, "ACL 2010 by Jing-Shin Chang and Philipp Koehn,": 221, "ACL 2008 by Johanna D. Moore, Simone Teufel, James Allan, and Sadaoki Furui,": 222, "ACL 2005 by Hwee Tou Ng and Kemal Oflazer,": 223, "ACL 2002 by Eugene Charniak and Dekang Lin,": 224, "and earlier ACL and EACL formats written by several people, including": 225, "John Chen, Henry S. Thompson and Donald Walker.": 226, "Additional elements were taken from the formatting instructions of the *International Joint Conference on Artificial Intelligence* and the *Conference on Computer Vision and Pattern Recognition*.": 227}